<template>
  <v-container class="text-h6 mt-4">
  以下の文章では本アプリのコンセプト、具体的な使用方法、メイン機能について解説しています。<br>

  <br>[本アプリのコンセプト]<br>

  <br>paradigm shift（パラダイムシフト）とは物の見方や考え方が劇的に変化することを指します。本アプリはアクティブラーニングで重要な要素である再言語化と想起を元にした学習を支援する SNSサービスになります。アクティブラーニングとは名前が示すとおり、積極的（アクティブ）に学習（ラーニング）に取 り組んでいく手法のことです。授業を聞きながらノートを取るような受け身の姿勢ではなく、進んで頭を使いながら学ぶ、これがアクティブラーニングの定義です。この学習法は科学的に効果が高いと認められている学習法になります。1つ目の「再言語化」は、簡単に言い換えると「自分の言葉に置き換えること」となります。たとえば、英語の「on」という前置詞の使い方を考えてみましょう。ここでもっとも良くないのは、「onは…の上に、…に、…に面して」など、辞書的な用法をそのまま覚えるパターンです。これではまったく応用が利かず、「on your honor」などのフレーズを目にした場合に、「なんで『名誉』にonを使うんだろう……」といった疑問が生まれてしまいます。しかし、ここで「onとは、具体的な物だけに限らずに、とにかく何かに接触していることだ」などと、自分の言葉で表現してみたらどうでしょうか？もちろん、これでも「on」を完璧に使いこなすのは難しいでしょうが、少なくとも例文の丸暗記よりは理解しやすくなったはずです。要するに「再言語化」とは、何かを理解するときに大事なポイントです。難しい数学の概念や完了形の意味のように、簡単に意味をつかめない情報を処理したいときには「再言語化」が欠かせません。2つ目の「想起」は、簡単に言えば「思い出すこと」です。人間の脳がもっとも活性化し、頭に情報を刻み込むのに最適な時期は、思い出す作業をした直後になります。つまり記憶として定着させるには思い出すのが最も効率的ということになります。このアプリでは、自分の学んでいる分野の用語を再言語化したものを投稿することで自分自身の理解を深めたり他人の再言語化の投稿を見ることによって新たな視点を発見しそれをクイズで想起する仕組みを作ることで記憶として定着させてparadigm shiftを起こすことを目的にしています。<br>

  <br>[具体的な使用方法]<br>

  <br>本アプリの具体的な使用方法としては単語帳(表に覚えたい単語を記入して裏に正解が書いてある紙が束ねられたポケットサイズのもの）をイメージしてください

  自分自身が学びたい分野の単語帳を自分自ら能動的に作成すること（アクティブラーニングの再現言語化）で理解を深めてそれをクイズによって積極的に思い出して（アクティブラーニングの想起)記憶に定着させるというのが大まかな流れになります

  ホーム画面右下にあるプラスボタンから投稿ができます。
  あなたが学習したい分野の単語を自分自身の言葉で表現してそれを投稿しましょう。自分なりの言葉で表現することでその学習中の概念に対する理解が深まります。
 
  記憶として定着させたい投稿があれば右下にあるハートマークをクリックしましょう。その投稿をお気に入りに登録することができます。

  投稿をお気に入りに追加することでクイズからその内容を出題することができます。何もヒントがない中で出題内容の言い換えをスラスラと思い出すことができれば、その概念の理解と記憶はクリアです。試験などで問われた際問題なく答えることができるようになるでしょう。

  自分の理解レベルでは上手く言い換えが思いつかない概念もあるでしょう。その場合はSerchから他のユーザーの投稿を検索してみて自分よりも理解が進んでいるユーザーの投稿を参考にしてみましょう。他のユーザーの投稿を参考にしてみて自分で再度概念の再言語化に挑戦するも良し、参考になった投稿をそのままお気に入り登録して自分の単語帳に加えるでも良しです。

  自分が学習したい分野のオリジナルな単語帳を作成し、より深い理解と記憶の定着を達成しましょう<br>


  <br>[メイン機能]<br>

  <br>メイン機能は6つあり、フッターにある6種類のボタンがそれに該当します。<br>

  <br>Home:自分の投稿とフォローしたユーザーの投稿を一覧で表示します<br>

  <br>Quiz:お気に入りをした投稿をフラッシュカードとして出題します<br>

  <br>Serch:本アプリに存在するuserと投稿をキーワード検索で探すことができます<br>

  <br>Ranking:評価の高い投稿をカテゴリーごとに一覧で表示します<br>

  <br>Notice:他ユーザーが自分をフォローまたは自分の投稿をお気に入りに追加した場合そのユーザーの一覧を表示します<br>

  <br>DM:他のユーザーと直接メッセージのやり取りができます<br>
  </v-container>
</template>

<script>
export default {

}
</script>

<style>

</style>